<form theme="dark">
 <label>Detecting Unencrypted Web Communications</label>
  <fieldset submitButton="false" autoRun="true">
    <input type="time" token="field1">
      <label></label>
      <default>
        <earliest>-24h@h</earliest>
        <latest>now</latest>
      </default>
    </input>
  </fieldset>
  <row>
    <panel>
      <table>

        <search>
                  <query>index=fg-i   NOT"0.0.0.0"	NOT"255.255.255.255" dest_port!=443  app=RDP bytes!=0
| table _time user app bytes* src_ip dest_ip dest_port</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </table>
    </panel>
  </row>
    <row>
    <panel>
      <table>

        <search>
                  <query>index=fg-i   NOT"0.0.0.0"	NOT"255.255.255.255" dest_port!=443 app="Console Management(SSH)" 
| table _time user app bytes* src_ip dest_ip dest_port</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </table>
    </panel>
  </row>
</form>
