<form theme="dark">
  <label>IP &amp; Port Scan</label>
  <fieldset submitButton="false" autoRun="true">
    <input type="time" token="field1">
      <label></label>
      <default>
        <earliest>-24h@h</earliest>
        <latest>now</latest>
      </default>
    </input>
  </fieldset>
   <row>
    <panel>
      <table>
        <title>FG-I Port  Scan -IP Scan With _time</title>
        <search>
          <query>  index=fg-i   | bucket _time span=1h| stats dc(dest_port) as num_dest_port dc(dest_ip) as num_dest_ip by src_ip,_time | where num_dest_port&gt;3000 OR num_dest_ip&gt;3000

</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="drilldown">none</option>
      </table>
    </panel>
  </row>
  <row>
    <panel>
      <chart>
        <title>Port Scan Count &gt; 11</title>
        <search>
          <query>index=windows EventCode=5156 Direction=Inbound Source_Address!="127.0.0.1" Source_Address!="::1" Source_Address!="255.255.255.255" Destination_Address!="255.255.255.255" Destination_Address!="0.0.0.0" Source_Address!="172.17.16.40" Source_Address!="0.0.0.0"   | bin _time span=1s| stats dc(Destination_Port) AS num_dest_port dc(Destination_Address) AS num_dest_ip BY Source_Address

| where num_dest_port &gt; 11 OR num_dest_ip &gt; 11</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="charting.chart">pie</option>
        <option name="charting.drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </chart>
    </panel>
    <panel>
      <chart>
        <title>Port Scan</title>
        <search>
          <query>index=windows EventCode=5156 Direction=Inbound Source_Address!="127.0.0.1" Source_Address!="::1" Source_Address!="255.255.255.255" Destination_Address!="255.255.255.255" Destination_Address!="0.0.0.0" Source_Address!="172.17.16.40" Source_Address!="0.0.0.0"   | bin _time span=1s| stats dc(Destination_Port) AS num_dest_port dc(Destination_Address) AS num_dest_ip BY Source_Address

| where num_dest_port &gt; 10 OR num_dest_ip &gt; 10</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="charting.chart">pie</option>
        <option name="charting.drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </chart>
    </panel>
  </row>
  <row>
    <panel>
      <chart>
        <title>FG Port Scan IP Scan Without time</title>
        <search>
          <query>index=fg-i   | bucket _time span=1h| stats dc(dest_port) as num_dest_port dc(dest_ip) as num_dest_ip by src_ip | where num_dest_port&gt;3000 OR num_dest_ip&gt;3000</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="charting.chart">pie</option>
        <option name="charting.drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </chart>
    </panel>
    <panel>
      <chart>
        <title>FG-I Port  Scan -IP Scan Without time</title>
        <search>
          <query>index=fg-i   | bucket _time span=1h| stats dc(dest_port) as num_dest_port dc(dest_ip) as num_dest_ip by src_ip | where num_dest_port&gt;1000 OR num_dest_ip&gt;1000</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="charting.chart">pie</option>
        <option name="charting.drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </chart>
    </panel>
    <panel>
      <chart>
        <title>Windows EventCode=5156 Port Scan</title>
        <search>
          <query>index=windows EventCode=5156 Direction=Inbound Source_Address!="127.0.0.1" Source_Address!="::1" Source_Address!="255.255.255.255" Destination_Address!="255.255.255.255" Destination_Address!="0.0.0.0"  Source_Address!="0.0.0.0"  | stats dc(Destination_Port) AS num_dest_port dc(Destination_Address) AS num_dest_ip BY Source_Address

| where num_dest_port &gt; 1000 OR num_dest_ip &gt; 1000</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="charting.chart">pie</option>
        <option name="charting.drilldown">none</option>
      </chart>
    </panel>
  </row>
 
</form>
