<form theme="dark">
  <label>RDP Connection</label>
  <fieldset submitButton="false" autoRun="true">
    <input type="time" token="field1">
      <label></label>
      <default>
        <earliest>-24h@h</earliest>
        <latest>now</latest>
      </default>
    </input>
  </fieldset>
  <row>
    <panel>
      <title>RDP Outbound To Inbound Action Accept</title>
      <table>
        <search>
          <query>index=fg-i   NOT"0.0.0.0"	NOT"255.255.255.255" dest_port!=443  app=RDP bytes!=0 NOT"172.18.81.42" src_ip!="172.*"  action!="blocked"  action!=teardown
| table _time user app bytes* src_ip dest_ip dest_port action</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </table>
    </panel>
  </row>
  <row>
    <panel>
      <title>RDP Outbound To Inbound Action ALL</title>
      <chart>
        <search>
          <query>index=fg-i   NOT"0.0.0.0"	NOT"255.255.255.255" dest_port!=443  app=RDP bytes!=0 NOT"172.18.81.42" src_ip!="172.*"  
| top src_ip</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="charting.chart">pie</option>
        <option name="charting.drilldown">none</option>
      </chart>
    </panel>
      <panel>
      <title>RDP  ALL NOT"172.18.81.42"    action!="blocked"  action!=teardown</title>
      <table>
        <search>
          <query>index=fg-i   NOT"0.0.0.0"	NOT"255.255.255.255" dest_port!=443  app=RDP bytes!=0 NOT"172.18.81.42"    action!="blocked"  action!=teardown
| top src_ip</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </table>
    </panel>
  </row>
  <row>
    <panel>
      <title>RDP Outbound To Inbound Action ALL</title>
      <table>
        <search>
          <query>index=fg-i   NOT"0.0.0.0"	NOT"255.255.255.255" dest_port!=443  app=RDP bytes!=0 NOT"172.18.81.42" src_ip!="172.*"  
| table _time user app bytes* src_ip dest_ip dest_port action</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </table>
    </panel>
  </row>

  <row>
    <panel>
      <title>RDP  ALL</title>
      <table>
        <search>
          <query>index=fg-i   NOT"0.0.0.0"	NOT"255.255.255.255" dest_port!=443  app=RDP bytes!=0 NOT"172.18.81.42"   
| table _time user app bytes* src_ip dest_ip dest_port action</query>
          <earliest>$field1.earliest$</earliest>
          <latest>$field1.latest$</latest>
        </search>
        <option name="drilldown">none</option>
        <option name="refresh.display">progressbar</option>
      </table>
    </panel>
  </row>
</form>
